In [1]:
a=10
b=20
c=a+b
print(c)

30

In [ ]:
============================EDA====================================================================
1-pandas             :data frme or data applications
2-numpy              :numerical python for math operation
3-matplotlib         :for plot graph
4-seaborn            :for plots graph
5-Bokhe              :for plot
6-plotly             :for plot
================================machine learning=====================================================
7-scikit learn(sklearn)       :ml model
8-stats                       :statistical models
================================data retrival from sql scrapping=====================================
9-sqlite                      :connect with database
10-beautiful soup             :scrap the data from webside
11-websocket                  :scarp
================================deep learning/computer vision==========================================
12-tensorflow                 :google
13-keras                      :dl models
14-open cv                    :image operation
15-pillow(pil)                :image operations
16-pytorch                    :facebook
17-pretrained model
     VGG16
     MOBILENET
     RESNET
     RCNNMASKRCNN
     FASTERCNN
     YOLO
================================NLP====================================
18-nltk:natural language process
19-scipy:
20-word2vec(how words will convert into vector):
21-glove:
22-word cloud
================================hugging face====================================
23-trnsformers:BERT(biderectional encoded )
================================genai models====================================
24-openai+microsoft:GPT models
25-google:gemini
26-amazon:Q
27-meta facebook:meta ai
28-apple


LLAMA
GEMMA
Dalle-E
T5
all are having different packages
================================langchain(it is a framework,used for all model)====================================
29-langchain framework
================================deployment====================================
30-flask
31-streamlit
32-django
================================MLops====================================
33-mlflow
34-kubeflow
35-azure ai service:azure packages
36-GCP:GCP packages

**step-1**

**creat a dataframe**

- we will creat a dataframe using list
- we will creat a dataframe using dictionary

In [6]:
import pandas as pd
d1=pd.DataFrame()
d1
type(d1)

pandas.core.frame.DataFrame

**step-2**

**privide the data**

In [7]:
name=["tarun","surendar","mohit"]
pd.DataFrame(name)

          0
0     tarun
1  surendar
2     mohit

In [27]:
name=["tarun","surendar","mohit"]
age=[20,30,40]
pd.DataFrame(zip(name,age))

          0   1
0     tarun  20
1  surendar  30
2     mohit  40

In [10]:
name=["tarun","surendar","mohit"]
city=["bbsr","blr","pune"]
age=[20,30,40]
pd.DataFrame(zip(name,city,age))

          0     1   2
0     tarun  bbsr  20
1  surendar   blr  30
2     mohit  pune  40

**step-3**

**provide the column names**

In [32]:
name=["tarun","surendar","mohit"]
pd.DataFrame(name,columns=["name"])

       name
0     tarun
1  surendar
2     mohit

In [31]:
name=["tarun","surendar","mohit"]
age=[20,30,40]
pd.DataFrame(zip(name,age),columns=["name","age"])

       name  age
0     tarun   20
1  surendar   30
2     mohit   40

In [14]:
name=["tarun","surendar","mohit"]
city=["bbsr","blr","pune"]
age=[20,30,40]
pd.DataFrame(zip(name,city,age),columns=["name","city","age"])

       name  city  age
0     tarun  bbsr   20
1  surendar   blr   30
2     mohit  pune   40

**step_4**

**provide index**

In [80]:
name=["tarun","surendar","mohit"]
age=[20,30,40]
pd.DataFrame(zip(name,age),index=["1","2","3"],columns=["name","age"])

       name  age
1     tarun   20
2  surendar   30
3     mohit   40

In [81]:
name=["tarun","surendar","mohit"]
city=["bbsr","blr","pune"]
age=[20,30,40]
pd.DataFrame(zip(name,city,age),index=[1,2,3],columns=["name","city","age"])

       name  city  age
1     tarun  bbsr   20
2  surendar   blr   30
3     mohit  pune   40

- creat a dataframe

- provide the data

- add columns

- provide the columns  name

- provide the index

**step_ 5**

  **add a new column on existing new dataframe**

In [3]:
import pandas as pd
name=["tarun","surendar","mohit"]
city=["bbsr","blr","pune"]
age=[20,30,40]
df=pd.DataFrame(zip(name,city,age),[1,2,3],("name","city","age"))
df

       name  city  age
1     tarun  bbsr   20
2  surendar   blr   30
3     mohit  pune   40

- if u want to add a new  column

- first check howany rows are there

- ex.in above data frame we have 3rows

- ur new column also should hae 3 rows

-suppose i want to creata new column,called salary

-make a list of salary of 3 values

- salary=[50000,60000,70000]

- syntax=df[column]=list of values

In [4]:
name=["tarun","surendar","mohit"]
city=["bbsr","blr","pune"]
age=[20,30,40]
df=pd.DataFrame(zip(name,city,age),[1,2,3],("name","city","age"))
df["salary"]=[50000,60000,70000]
df

       name  city  age  salary
1     tarun  bbsr   20   50000
2  surendar   blr   30   60000
3     mohit  pune   40   70000

In [7]:
name=["tarun","surendar","mohit"]
city=["bbsr","blr","pune"]
age=[20,30,40]
df=pd.DataFrame(zip(name,city,age),[1,2,3],("name","city","age"))
salary=[50000,60000,70000]
df["salary"]=salary
df

       name  city  age  salary
1     tarun  bbsr   20   50000
2  surendar   blr   30   60000
3     mohit  pune   40   70000

**use case_1**

creat a empty dataframe,creat 3 list using list comprehension

l1=a values from 1 to 10

l2=squre of 1 to 10

l3=cub of 1 to 10

creat a dataframe

In [13]:
df=pd.DataFrame()
l1=[i for i in range (1,11)]
l2=[i*i for i in range(1,11)]
l3=[i*i*i for i in range(1,11)]
df["values"]=l1
df["squre"]=l2
df["cube"]=l3
df

   values  squre  cube
0       1      1     1
1       2      4     8
2       3      9    27
3       4     16    64
4       5     25   125
5       6     36   216
6       7     49   343
7       8     64   512
8       9     81   729
9      10    100  1000

In [83]:
df=pd.DataFrame()
l1=[i for i in range (1,11)]
l2=[i*i for i in range(1,11)]
l3=[i*i*i for i in range(1,11)]
df["x"]=l1
df["y"]=l2
df["z"]=l3
df

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

**step_6**

**update the already existed column**

- creat a new column

- update existin culumn are same way only

- creating a neww colmn,the coumn name is our choice.

- here also we need a make a list  of values=no.of rows

- while updating the existing col.
    
- we needto provide already existed column name only
    
- df["z"]=list of values

In [82]:
#data frame  name is df:
#list name=z
#which col we want to update=z
l4=[i*i*i*i for i in range(1,11)]
df["z"]=l4
df

    x    y      z
0   1    1      1
1   2    4     16
2   3    9     81
3   4   16    256
4   5   25    625
5   6   36   1296
6   7   49   2401
7   8   64   4096
8   9   81   6561
9  10  100  10000

**step_7**

**how to drop a column**

In [21]:
#how to check the columns
df.columns

Index(['x', 'y', 'z'], dtype='object')

- if uwant to drop a specific column

- we will use drop method

- we lready know about diff between keywords and methods

- keywords will use directly,but methods will come coressponding dataframe

- **the  method name is drop()**

- column:which col. u want to drop

- axis:represents the specified val. isa row or col.

    - axis=0 means rows.
    - axis=1 means column

- bydefault axis=0

- inplace():will provide override the dataframe or not

- inplac()=true,this indicate overwrite the dataframe

- inplace()=false,this indicates modified dataframe will be used when u provide new variable for option

In [85]:
l4=[i*i*i*i for i in range(1,11)]
df["z"]=l4
df

    x    y      z
0   1    1      1
1   2    4     16
2   3    9     81
3   4   16    256
4   5   25    625
5   6   36   1296
6   7   49   2401
7   8   64   4096
8   9   81   6561
9  10  100  10000

In [76]:
df.drop("z",axis=1,inplace=True)
#after this in a new cell type df1
#u will see original dataframe
#bcoz,we didnot provide inplace
#if u want to use below o/p
#u need to assign a variable

KeyError: "['z'] not found in axis"

In [77]:
df

    x    y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

**step_8**

**drop the row**

- drop the row and drop the column,both ar similar only
  
-  the difference is axis:
-  axis=0:represent 0, by default axis=0,available
-  which means if we provide any value,it will represent row only

In [48]:
import pandas as pd
df=pd.DataFrame()
l1=[i for i in range (1,11)]
l2=[i*i for i in range(1,11)]
l3=[i*i*i for i in range(1,11)]
df["x"]=l1
df["y"]=l2
df["z"]=l3
df

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [47]:
df.drop("x")
#if u run this u willl get a error
#by default axis=0,which represents about rows
#but "x" is a column
#if u want to drop the row,provide the row index

KeyError: "['x'] not found in axis"

In [49]:
#if u want to drop row,then provide the row index
df.drop(4)          #it delete row no.4

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [50]:
#it delete multiple rows
#multiple column alwas put in a list
df.drop([3,8])

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
9  10  100  1000

In [51]:
#it gives the original data,bcoz there is no inplace
df

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [7]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [55]:
df.drop([0,1],axis=1)
# [0,1] index
# axis=1  column
# error

**step_9**

**how to select columns**

**3 ways to show the column**
    
- 2 types
    
    - 1-df["x"]:seriese type

    - 2-df[["x"]]:dataframe

    - 3-df.x:seriese type

In [128]:
#single bracket only no.will come,no column name display
#seriese type
#whenever u see this type  :seriese type
df["x"]

In [14]:
type(df["x"])

pandas.core.series.Series

In [13]:
#dataframe type
#it display the column name

df[["x"]]

    x
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [12]:
type(df[["x"]])

pandas.core.frame.DataFrame

In [16]:
df.x

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: x, dtype: int64

In [68]:
df[["x","y"]]
#type(df[["x","y"]])     :dataframe type

    x    y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [70]:
cols=["x","y"]
df[cols]
#type(df[cols])

    x    y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [ ]:
df=

In [ ]:
- all vaues come in an array
- it is a list of elements only represents using numpy package
- generally elements present n 4 ways
- list          :basic representation
- numpy array   :array with numpy
- tensor        :tensorfolw package
- torch         :pytorch package

In [74]:
df["x"].values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10], dtype=int64)

In [19]:
list1=[1,2,3,4]
list1

[1, 2, 3, 4]

In [21]:
import numpy as np
np.array(list1)

array([1, 2, 3, 4])

In [23]:
#tensor([1,2,3,4])

In [27]:
list1=[1,2,3,4]
list2=[1,20,30,40]
list1+list2

[1, 2, 3, 4, 1, 20, 30, 40]

In [77]:
list1=[1,2,3,4,]
list2=[1,20,30,40]
l1=np.array(list1)
l2=np.array(list2)
l1+l2

array([ 2, 22, 33, 44])

**add an column**

In [28]:
df["x"].values
# imagine we worked on an ml problem
# we got some seriese of values
# with that seriese of values  also we can creat a dataframe

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10], dtype=int64)

In [30]:
df["p"]=df["x"].values
df

    x    y     z   p
0   1    1     1   1
1   2    4     8   2
2   3    9    27   3
3   4   16    64   4
4   5   25   125   5
5   6   36   216   6
6   7   49   343   7
7   8   64   512   8
8   9   81   729   9
9  10  100  1000  10

**save the dataframe**

**how to save the data frame**

- dataframe we can save in 2 format
 
  - c.s.v:(comma separated values)
    
  - xlsx:excel format
    
  - in order to save any data
    
  - where u want to save:directory name
    
  - what is the name of the file,for storing
    
  - what is the extension
  
  - we already seen same in file handling session

In [ ]:
#case-1:save file in same location
#no need to provide directory path
#directory give only name of the file and extension

In [123]:
import pandas as pd
df=pd.DataFrame()
l1=[i for i in range (1,11)]
l2=[i*i for i in range(1,11)]
l3=[i*i*i for i in range(1,11)]
df["values"]=l1
df["squre"]=l2
df["cube"]=l3
df

   values  squre  cube
0       1      1     1
1       2      4     8
2       3      9    27
3       4     16    64
4       5     25   125
5       6     36   216
6       7     49   343
7       8     64   512
8       9     81   729
9      10    100  1000

In [124]:
#dataframe name:df
df.to_csv("data1.csv",index=False)
df.to_excel("data1.xlsx",index=False)

**step _11**

**how to read a dataframe**

In [125]:
df=pd.read_csv('data1.csv')
print(df)

   values  squre  cube
0       1      1     1
1       2      4     8
2       3      9    27
3       4     16    64
4       5     25   125
5       6     36   216
6       7     49   343
7       8     64   512
8       9     81   729
9      10    100  1000

In [126]:
df=pd.read_excel('data1.xlsx')
print(df)

   values  squre  cube
0       1      1     1
1       2      4     8
2       3      9    27
3       4     16    64
4       5     25   125
5       6     36   216
6       7     49   343
7       8     64   512
8       9     81   729
9      10    100  1000

**step_12**

**how to avoid index column**

- while we save the dataframe

- automatically a new column will come

- that we need to avoid

- permission denied means close the datafile from laptop

In [106]:
#dataframe name:df
#save the data without an index column
df.to_csv("data1.csv",index=False)
df.to_excel("data1.xlsx",index=False)

In [105]:
#read the data
df=pd.read_csv('data1.csv')
df=pd.read_excel('data1.xlsx')